Power-Law/wedge_needles/temperature/35_temp/45_needle_layer/0/grad(U)
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volTensorField;
    location    "0";
    object      grad(U);
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    wall
    {
        type            extrapolatedCalculated;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }
    wedge1
    {
        type            wedge;
    }
    wedge2
    {
        type            wedge;
    }
}


// ************************************************************************* //
